[
  {
    "plantName": "Snake Plant",
    "category": "Air Purifier",
    "price": 1800,
    "rating": 4.8,
    "availableStock": 10,
    "careLevel": "Easy",
    "description": "Resilient architectural plant with striking upright leaves that filters toxins from air while requiring minimal attention, perfect for beginners and busy lifestyles.",
    "descriptionLong": "The Snake Plant stands as one of nature's most forgiving houseplants, featuring bold sword-like leaves that rise dramatically from the soil in shades of deep green with yellow margins. Beyond its sculptural beauty, this remarkable plant works tirelessly to purify your indoor air by removing toxins like formaldehyde and benzene. It thrives in virtually any light condition from bright indirect to deep shade, requires watering only every few weeks, and tolerates neglect better than most plants. Native to West Africa, it stores water in its thick leaves, making it incredibly drought-resistant. The Snake Plant also releases oxygen at night, unlike most plants, making it an ideal bedroom companion. Whether you're a first-time plant parent or a seasoned collector, this low-maintenance beauty adds instant style to any space while working silently to create a healthier home environment. Its vertical growth habit makes it perfect for tight corners and small spaces where you want maximum impact with minimal footprint.",
    "image": "https://mygreenscape.ca/cdn/shop/articles/image3_71ea6a70-45c4-4f0c-8369-4f18a10f4dd5.png?v=1732599548&width=1100",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantName": "Peace Lily",
    "category": "Flowering Plant",
    "price": 2200,
    "rating": 4.7,
    "availableStock": 15,
    "careLevel": "Medium",
    "description": "Graceful tropical beauty producing elegant white blooms above glossy foliage, naturally filtering airborne toxins while adding sophistication to any interior.",
    "descriptionLong": "The Peace Lily captivates with its serene elegance, producing stunning white spathe flowers that appear to float above its lush, dark green foliage. This tropical wonder doesn't just look beautiful—it's a powerhouse air purifier, removing harmful toxins like ammonia, benzene, and formaldehyde from your environment. Native to the rainforests of Central and South America, it thrives in medium to low light conditions, making it perfect for offices and rooms without bright windows. The Peace Lily communicates its needs clearly by drooping when thirsty, then perking up dramatically after watering. It prefers consistently moist soil and higher humidity, though it adapts well to average home conditions. The plant blooms reliably throughout the year when happy, with each elegant white flower lasting for weeks. Beyond its aesthetic appeal, the Peace Lily has been proven by NASA studies to be among the top air-cleaning plants, making it both a decorative choice and a healthy addition to your living space. Perfect for bathrooms, bedrooms, or any area where you want to combine natural beauty with cleaner air.",
    "image": "https://cdn.mos.cms.futurecdn.net/qYNPupRnspGWPF4886Z7hB.jpg",
    "providerName": "GreenNest Botanics"
  },
  {
    "plantName": "ZZ Plant",
    "category": "Low Light Plant",
    "price": 2500,
    "rating": 4.9,
    "availableStock": 8,
    "careLevel": "Easy",
    "description": "Virtually indestructible plant with glossy leaves that prospers in low light and irregular watering, ideal for anyone seeking foolproof greenery with modern appeal.",
    "descriptionLong": "The ZZ Plant represents the ultimate in low-maintenance houseplants, boasting thick, waxy leaves that shine like they've been polished. This African native stores water in its potato-like rhizomes underground, allowing it to survive weeks or even months without watering. Its architectural growth pattern creates a striking silhouette that fits seamlessly into contemporary interiors. The ZZ Plant thrives in the dimmest corners where other plants would struggle, though it also tolerates bright indirect light beautifully. Its slow but steady growth means you won't need to repot frequently, and it's remarkably resistant to pests and diseases. The plant's glossy foliage naturally repels dust, keeping it looking fresh with minimal effort. New growth emerges as bright lime-green shoots that darken over time, creating visual interest. While it's toxic if ingested, making it unsuitable for homes with curious pets or children, its resilience makes it perfect for offices, apartments, and any space where consistent plant care is challenging. The ZZ Plant proves that low-maintenance doesn't mean boring—it's a sophisticated choice that delivers maximum style with minimal effort.",
    "image": "https://gardenerspath.com/wp-content/uploads/2022/03/How-to-Grow-ZZ-Plants-Feature.jpg",
    "providerName": "EcoLeaf Garden"
  },
  {
    "plantName": "Spider Plant",
    "category": "Air Purifier",
    "price": 1600,
    "rating": 4.6,
    "availableStock": 20,
    "careLevel": "Easy",
    "description": "Cheerful cascading plant with arching variegated foliage that naturally purifies air and produces adorable baby plantlets for endless propagation possibilities.",
    "descriptionLong": "The Spider Plant delights with its fountain-like growth habit, sending out gracefully arching leaves striped in green and white that create a living waterfall of foliage. This cheerful plant earned its name from the tiny plantlets, or spiderettes, that dangle from long stems like spiders on silk threads. These babies can be easily propagated to share with friends or expand your own collection. As an exceptional air purifier, the Spider Plant efficiently removes pollutants including formaldehyde and xylene from indoor environments. It adapts to various light conditions from bright indirect to moderate light, though brighter light enhances its variegation. The plant tolerates occasional neglect and irregular watering, bouncing back quickly when given attention. It's completely non-toxic, making it safe for homes with pets and children. Spider Plants thrive in hanging baskets where their cascading nature can be fully appreciated, or as tabletop specimens in decorative pots. They prefer slightly root-bound conditions and will reward you with more plantlets when they feel cozy. Native to South Africa, this adaptable beauty has been a houseplant favorite for generations, proving that classic plants never go out of style.",
    "image": "https://www.thesill.com/cdn/shop/articles/73cc14cd4cbc12d7985c8e83a7d57ed1e69cec5f-1200x856.webp?v=1727201537",
    "providerName": "FreshAir Flora"
  },
  {
    "plantName": "Aloe Vera",
    "category": "Medicinal Plant",
    "price": 1900,
    "rating": 4.8,
    "availableStock": 12,
    "careLevel": "Easy",
    "description": "Medicinal succulent with plump gel-filled leaves offering natural healing properties, air purification, and striking architectural form with minimal care requirements.",
    "descriptionLong": "Aloe Vera stands as both a beautiful houseplant and a natural pharmacy, storing precious clear gel in its thick, fleshy leaves that soothes burns, cuts, and skin irritations. This ancient healing plant, used for thousands of years across cultures, brings practical wellness benefits to your home alongside its sculptural beauty. The plant's spiky, upright leaves arranged in an elegant rosette create modern architectural interest that complements any decor style. As a succulent, Aloe thrives on neglect, requiring infrequent watering and bright, indirect sunlight. It's nearly impossible to kill with proper drainage and occasional attention. Beyond its medicinal properties, Aloe Vera purifies indoor air by filtering toxins and releases oxygen at night, making it beneficial for bedrooms. The plant occasionally produces tall spikes of tubular yellow or orange flowers when conditions are ideal. It readily produces offsets or pups around its base, which can be separated to create new plants. Native to the Arabian Peninsula, Aloe has adapted to thrive in dry conditions, storing water in its leaves for times of drought. Whether you're growing it for its health benefits or its attractive form, Aloe Vera is a functional beauty that earns its place in any home.",
    "image": "https://www.thespruce.com/thmb/bW_aNpJmmnM0a_ySCdsYanFuAEM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/_DSC58741-476b7f7ef66d44ba8ce33cbc0d7b8dd4.jpg",
    "providerName": "NatureCore Plants"
  },
  {
    "plantName": "Rubber Plant",
    "category": "Foliage Plant",
    "price": 2800,
    "rating": 4.5,
    "availableStock": 9,
    "careLevel": "Medium",
    "description": "Bold statement plant featuring large glossy burgundy-tinged leaves that create dramatic focal points while efficiently filtering indoor air pollutants.",
    "descriptionLong": "The Rubber Plant commands attention with its magnificent oversized leaves that gleam as if freshly polished, ranging from deep emerald to rich burgundy depending on variety. This stunning tree can grow from a modest tabletop plant into an impressive floor specimen reaching ceiling height indoors, creating a powerful architectural presence. Native to Southeast Asia, the Rubber Plant earned its name from the latex sap it produces, once harvested for rubber production. Today it's prized as a powerful air purifier, particularly effective at removing formaldehyde from indoor environments. The plant thrives in bright, indirect light and prefers to dry out slightly between waterings, making care relatively straightforward. New leaves emerge in protective red sheaths that drop away to reveal the glossy foliage beneath, creating an ongoing display of renewal. Regular leaf wiping maintains the signature shine and helps the plant photosynthesize efficiently. While it prefers consistent care, the Rubber Plant is forgiving of occasional lapses and can adapt to various indoor conditions. Its bold presence makes it perfect for filling empty corners, flanking furniture, or creating living focal points in modern, minimalist, or traditional interiors. This is a plant that grows with you, literally.",
    "image": "https://shop-static.arborday.org/media/0004361_ruby-variegated-rubber-tree.jpeg",
    "providerName": "Leaf & Root Co."
  },
  {
    "plantName": "Boston Fern",
    "category": "Hanging Plant",
    "price": 2100,
    "rating": 4.4,
    "availableStock": 14,
    "careLevel": "Medium",
    "description": "Lush Victorian-era favorite with cascading feathery fronds that naturally humidify air and create romantic, verdant displays in hanging baskets or pedestals.",
    "descriptionLong": "The Boston Fern enchants with its gracefully arching fronds covered in delicate, lacy leaflets that create a soft, romantic cloud of greenery. This classic Victorian-era houseplant has remained popular for over a century thanks to its timeless elegance and air-purifying abilities. Unlike many houseplants, Boston Ferns actually add humidity to your environment, making them excellent natural humidifiers that benefit both your skin and respiratory health. They thrive in bright, indirect light and prefer consistently moist soil with high humidity, making them ideal for bathrooms or kitchens where moisture levels are naturally higher. The plant's cascading habit looks spectacular in hanging baskets, on plant stands, or atop pedestals where its fronds can drape freely. While it requires more attention than some houseplants, the Boston Fern rewards attentive care with lush, abundant growth that creates a verdant focal point. Regular misting helps maintain the humidity it craves, and occasional trimming of brown fronds keeps it looking pristine. Native to tropical regions worldwide, this fern brings a touch of the forest indoors, creating a cooling, calming presence in any room. Its full, fluffy appearance makes spaces feel more alive and inviting, perfect for plant lovers seeking that abundant jungle vibe.",
    "image": "https://planetdesert.com/cdn/shop/files/Boston-fern-plant-jpj.jpg?v=1730909853",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantName": "Pothos",
    "category": "Trailing Plant",
    "price": 1700,
    "rating": 4.9,
    "availableStock": 18,
    "careLevel": "Easy",
    "description": "Vigorous trailing vine with heart-shaped variegated leaves that adapts to virtually any condition, growing rapidly to soften spaces with cascading greenery.",
    "descriptionLong": "Pothos, affectionately known as Devil's Ivy for its near-impossible-to-kill nature, ranks among the world's most beloved houseplants. Its heart-shaped leaves in shades of green, yellow, and white create stunning cascades that can trail several feet, bringing life to shelves, mantels, and hanging baskets. This vigorous grower adapts to almost any light condition from low to bright indirect, though variegation is most pronounced in better light. Pothos tolerates irregular watering, occasional neglect, and a wide range of temperatures, making it perfect for beginners or anyone seeking foolproof greenery. The plant's trailing vines can be trained to climb using supports or allowed to cascade freely, offering versatile styling options. It's an excellent air purifier, particularly effective at removing indoor pollutants like formaldehyde, benzene, and xylene. Pothos propagates incredibly easily from stem cuttings placed in water or soil, making it simple to multiply your collection or share with friends. Native to the Solomon Islands, this tropical vine has adapted to become one of the most successful houseplants globally. Its rapid growth means you'll quickly achieve that lush, established look, transforming bare spaces into verdant displays. Whether you want to create a green curtain, soften hard edges, or add life to any corner, Pothos delivers with minimal fuss and maximum impact.",
    "image": "https://www.marthastewart.com/thmb/9etIquryA7k90xAxOOOwAVZMA60=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-2170686151-675aeaba15364e1c876dc485f7e6d8d8.jpg",
    "providerName": "GreenNest Botanics"
  },
  {
    "plantName": "Monstera Deliciosa",
    "category": "Tropical Plant",
    "price": 3500,
    "rating": 4.9,
    "availableStock": 7,
    "careLevel": "Medium",
    "description": "Iconic split-leaf plant creating instant jungle vibes with dramatic perforated foliage that makes bold design statements while remaining surprisingly easy to maintain.",
    "descriptionLong": "The Monstera Deliciosa has become the poster child of modern plant parenthood, instantly recognizable by its enormous leaves featuring distinctive splits and holes that give it the nickname Swiss Cheese Plant. These natural perforations, called fenestrations, develop as the plant matures, creating increasingly dramatic foliage that brings immediate tropical drama to any space. Native to Central American rainforests, this climbing plant can grow impressively large indoors with proper support, or be trained to trail for a different aesthetic. The Monstera thrives in bright, indirect light and appreciates regular watering when the top inch of soil dries out. It's more forgiving than its trendy status might suggest, bouncing back from occasional neglect. The plant's aerial roots add to its wild, jungle character and can be directed into soil for additional support. Monstera leaves grow larger and develop more splits with maturity and proper care, rewarding patient plant parents with increasingly spectacular foliage. Beyond its striking appearance, the Monstera is an effective air purifier and relatively pest-resistant. Its architectural presence makes it perfect for filling empty corners, creating focal points, or adding that coveted biophilic design element to modern interiors. This is a plant that photographs beautifully and lives even better.",
    "image": "https://growurban.uk/cdn/shop/articles/care-guide-monstera-deliciosa-668092_680bbf00-9564-4f0c-b9cb-27ededaf19d2.jpg?v=1748436514&width=2048",
    "providerName": "EcoLeaf Garden"
  },
  {
    "plantName": "Fiddle Leaf Fig",
    "category": "Foliage Plant",
    "price": 3200,
    "rating": 4.6,
    "availableStock": 6,
    "careLevel": "Hard",
    "description": "Dramatic designer favorite with enormous violin-shaped leaves creating sculptural presence, demanding consistent care but rewarding with unmatched elegance and impact.",
    "descriptionLong": "The Fiddle Leaf Fig reigns as the undisputed champion of statement houseplants, featuring massive leaves shaped like violins that can span up to fifteen inches across. This architectural beauty has dominated interior design magazines and Instagram feeds, and for good reason—few plants create such immediate visual impact. Native to West African rainforests, the Fiddle Leaf Fig grows as a tree that can reach impressive heights indoors, developing a strong trunk and branching structure that adds living sculpture to your space. However, this diva of the plant world demands attention and consistency. It requires bright, indirect light and prefers to stay in one spot, as moving it can cause stress and leaf drop. The plant likes its soil to dry slightly between waterings and is sensitive to both overwatering and underwatering. Despite its reputation for being finicky, many plant lovers successfully grow Fiddle Leaf Figs by establishing consistent care routines. Regular leaf cleaning maintains the signature glossy appearance and supports healthy growth. When happy, new leaves unfurl regularly from the top, each one emerging from a protective sheath. The Fiddle Leaf Fig rewards dedicated care with years of stunning presence, transforming rooms into sophisticated, magazine-worthy spaces that showcase your commitment to bringing nature indoors with style.",
    "image": "https://gardeningsg.nparks.gov.sg/images/Plants/fiddleleaffig%20(7)_jacquelinechua.jpg",
    "providerName": "Leaf & Root Co."
  },
  {
    "plantName": "String of Pearls",
    "category": "Succulent",
    "price": 1500,
    "rating": 4.7,
    "availableStock": 11,
    "careLevel": "Medium",
    "description": "Whimsical trailing succulent with bead-like leaves cascading like natural jewelry, offering unique texture and form while requiring minimal watering and care.",
    "descriptionLong": "String of Pearls captivates with its extraordinary appearance, featuring perfectly round succulent beads strung along delicate stems like living pearl necklaces. This South African native creates a mesmerizing display when allowed to trail from hanging baskets or cascade over pot edges, with strands that can grow several feet long. Each spherical leaf stores water, making this succulent remarkably drought-tolerant and perfect for forgetful waterers. The plant thrives in bright, indirect light near a sunny window where its unique form can be fully appreciated. String of Pearls prefers to dry out completely between waterings and requires excellent drainage to prevent root rot. During late summer, mature plants may produce small white flowers with a pleasant cinnamon-like fragrance. The trailing habit makes it ideal for adding vertical interest to shelves, creating living curtains, or spilling from mixed succulent arrangements. Propagation is straightforward—simply lay stem cuttings on moist soil and they'll root readily, allowing you to multiply your collection or repair sparse areas. While it requires specific care regarding water and light, String of Pearls isn't demanding once you understand its needs. This conversation-starting plant brings an element of whimsy and texture that few houseplants can match, perfect for anyone seeking something truly distinctive in their indoor garden.",
    "image": "https://www.marthastewart.com/thmb/fBoDB1le7AHp5pM0p0xFvtKUYgg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/string-of-pearls-plant-windowsill-getty-0423-2000-2ab4a535d4454568a5e12710b67f7d25.jpg",
    "providerName": "EcoLeaf Garden"
  },
  {
    "plantName": "Chinese Money Plant",
    "category": "Foliage Plant",
    "price": 1850,
    "rating": 4.8,
    "availableStock": 13,
    "careLevel": "Easy",
    "description": "Charming plant with perfectly round coin-shaped leaves on delicate stems, symbolizing prosperity while offering easy care and abundant baby plants for sharing.",
    "descriptionLong": "The Chinese Money Plant charms everyone with its distinctive circular leaves that resemble coins floating on thin, graceful stems. This delightful plant from southern China carries symbolism of good fortune and prosperity, making it a meaningful gift for friends and loved ones. Its unique appearance, sometimes called the UFO Plant or Pancake Plant, creates playful visual interest that works in any decor style from minimalist to eclectic. The plant grows best in bright, indirect light and prefers to dry out slightly between waterings, making care relatively straightforward. One of its most endearing qualities is the generous production of baby plantlets, or pups, that emerge from the soil around the mother plant. These can be separated and potted individually, allowing you to share the wealth with friends or build your own collection. The Chinese Money Plant's leaves naturally orient themselves toward light, so rotating the plant regularly maintains even growth and prevents leaning. Its compact size makes it perfect for desks, shelves, and small spaces where you want personality without overwhelming the area. The plant grows steadily without becoming unmanageable, maintaining an attractive dome shape with minimal intervention. This combination of easy care, unique appearance, and generous nature has made the Chinese Money Plant increasingly popular among both new and experienced plant parents seeking something special.",
    "image": "https://images.immediate.co.uk/production/volatile/sites/10/2021/03/2048x1365-Pilea-Peperomioides-SEO-GettyImages-1225860485-79b134d.jpg",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantName": "Bird of Paradise",
    "category": "Tropical Plant",
    "price": 4200,
    "rating": 4.5,
    "availableStock": 5,
    "careLevel": "Medium",
    "description": "Majestic tropical specimen with enormous paddle-shaped leaves creating instant resort vibes, potentially producing exotic orange bird-like flowers with patient care.",
    "descriptionLong": "The Bird of Paradise commands attention as one of the most dramatic houseplants available, featuring enormous leaves that can span several feet across, reminiscent of banana plants. This South African native brings an immediate sense of tropical luxury to any space, transforming ordinary rooms into exotic retreats. The plant's common name comes from its spectacular flowers that resemble brightly colored tropical birds in flight, though blooming indoors requires patience, maturity, and ideal conditions. Even without flowers, the Bird of Paradise makes a stunning architectural statement with its bold foliage and upright growth habit. It thrives in bright, indirect to direct light and benefits from consistent watering during growing season, though it tolerates some drought once established. The plant appreciates regular feeding during active growth and can reach impressive sizes indoors, making it perfect for filling large spaces or creating dramatic focal points. New leaves emerge tightly rolled and unfurl gradually, revealing their full glory over several days. While the leaves may develop natural splits and tears over time—a characteristic feature rather than a problem—this adds to the plant's wild, tropical character. The Bird of Paradise requires space to truly shine but rewards that commitment with unmatched tropical elegance. Perfect for plant enthusiasts ready to make a bold statement and create that vacation-at-home feeling year-round.",
    "image": "https://www.thespruce.com/thmb/-rU-vGiOQ-8jlT8RkHKeN88_lik=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc()/SPR-bird-of-paradise-plants-2132859-hero-83ba0a370f284175a229ce271790e133.jpg",
    "providerName": "FreshAir Flora"
  },
  {
    "plantName": "Calathea Ornata",
    "category": "Foliage Plant",
    "price": 2400,
    "rating": 4.6,
    "availableStock": 10,
    "careLevel": "Hard",
    "description": "Striking prayer plant with dark green leaves painted with delicate pink stripes, performing nightly folding rituals while demanding higher humidity and attentive care.",
    "descriptionLong": "Calashes Ornate mesmerizes with its exquisite foliage featuring deep green leaves adorned with delicate pink pinstripes that look hand-painted by nature. This Brazilian beauty belongs to the prayer plant family, exhibiting the fascinating behavior of folding its leaves upward at night as if in prayer, then opening them again at dawn—a daily rhythm that adds living movement to your space. The leaf undersides reveal rich purple coloring that flashes as the plant performs its nightly ritual. This natural movement, called nyctinasty, is accompanied by a gentle rustling sound that devoted plant parents cherish. However, Calathea Ornata earns its reputation as a challenging plant, requiring higher humidity, consistent moisture, and careful attention to thrive. It prefers bright, indirect light but scorches easily in direct sun, and it's sensitive to both chlorine and fluoride in tap water, making filtered or distilled water ideal. The plant dislikes temperature fluctuations and dry air, making it better suited for experienced plant parents or those willing to invest in humidifiers and careful monitoring. Despite these demands, successfully growing this stunning plant brings immense satisfaction. Regular misting, pebble trays, or grouping with other plants helps maintain the humidity it craves. When happy, Calathea Ornata rewards with lush, pristine foliage that showcases nature's artistry, making every effort worthwhile for those seeking a truly special houseplant.",
    "image": "https://www.thespruce.com/thmb/tTe_1NDKv2GDj7PeQV1bo5n6Dtg=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc()/SPS-calathea-ornata-04-f03b60a264fd49e1b8abf15282fcf607.jpg",
    "providerName": "NatureCore Plants"
  }
]
